Autodesk.Revit.DB.InternalDefinition.SetAllowVaryBetweenGroups(Autodesk.Revit.DB.Document,System.Boolean)
Whether or not the parameter values can vary across group members.
Remarks:
When a parameter is set to not vary between groups Revit will automatically align the parameter values
of any elements that actually varied between group instances.
document:
The document of this parameter.
allowVaryBetweenGroups:
Whether this parameter should be allowed to vary between groups.
Returns:
The ids of elements that were updated to align the values between groups.
Throws Autodesk.Revit.Exceptions.ArgumentException:
This parameter does not support the specified value of allowVaryBetweenGroups.
-or-
document is not a project document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2014

Autodesk.Revit.DB.InternalDefinition.GetTypeId
Gets the identifier of the parameter.

Autodesk.Revit.DB.InternalDefinition.GetParameterTypeId
Tests whether this definition identifies a built-in parameter or not.
Remarks:  For a built-in parameter this method returns one of the ParameterTypeId static properties.
For custom-defined parameters, such as shared, global, or family parameters the value is null.

Autodesk.Revit.DB.InternalDefinition.SetGroupTypeId(Autodesk.Revit.DB.ForgeTypeId)
Sets the built-in parameter group to which the parameter defined by this definition belongs.
Remarks: The parameter group can be changed, but only for parameters that are not built in.
In other words: This method is only valid for parameter definitions for which
GetParameterTypeId() returns a null identifier.
groupTypeId: Identifier of the built-in parameter group.

Autodesk.Revit.DB.InternalDefinition.GetGroupTypeId
Gets the identifier of the built-in parameter group to which the parameter defined by this definition belongs.